{"title":"Cosmos","url":"https://www.cosmosportugal.com/en-gb/properties/aljezur","favicon":"https://www.cosmosportugal.com/DevGear/Favicon/android-icon-192x192.png","elements":[{"title":"Immaculate 3 bed Villa in Vale da Telha 530 000 €","contents":" Immaculate 3 bed Villa in Vale da Telha This beautifully maintained 3 bedroom, 2 bathroom villa in Vale da Telha is move-in ready, offering an abundance of space, comfort, and natural light. Nestled on a quiet road and just a short walk fr... Ref. M-0224 3                                                                                                                                                                                                                                                                                                                                                                        2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 197 m² 530 000 €","link":"https://www.cosmosportugal.com/en-gb/property/immaculate-3-bed-villa-in-vale-da-telha/22684239","retrieved":1747003485362},{"title":"Unique restaurant opportunity on N120 near Aljezur, primed for your success! 800 000 €","contents":" Unique restaurant opportunity on N120 near Aljezur, primed for your success! This exceptional, fully operational restaurant is perfectly located along the bustling N120, just before reaching the charming town of Aljezur. Boasting excellent passing trade, this thriving establi... Ref. C-0020 230 m²                                                                                                                                                                                                                                                                                                                                                                        300 m² 800 000 €","link":"https://www.cosmosportugal.com/en-gb/property/unique-restaurant-opportunity-on-n120-near-aljezur-primed-for-your-success/8094370","retrieved":1747330752203},{"title":"CHARMING VILLA NEAR ARRIFANA BEACH 597 000 €","contents":" CHARMING VILLA NEAR ARRIFANA BEACH Charming Villa Ideal for Holidays or Investment. Nestled in the serene surroundings of Vale da Telha, just minutes from the stunning Arrifana Beach, this well-maintained and low-maintenance villa off... Ref. M-0227 3                                                                                                                                                                                                                                                                                                                                                                        2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         161 m²                                                                                                                                                                                                                                                                                                                                                                        166 m² 597 000 €","link":"https://www.cosmosportugal.com/en-gb/property/charming-villa-near-arrifana-beach/22980954","retrieved":1747158049092},{"title":"Spacious 4 bed Villa with Private Garden & Pool Backing onto Rustic Land 685 000 €","contents":" Spacious 4 bed Villa with Private Garden & Pool Backing onto Rustic Land Located in the popular urbanisation of Vale da Telha, this spacious and well-kept villa offers a great balance of privacy, comfort, and indoor-outdoor living. Surrounded by nature on two sides and wi... Ref. M-0226 4                                                                                                                                                                                                                                                                                                                                                                        4                                                                                                                                                                                                                                                                                                                                                                                                                                 Outdoor                                                                                                                                                                                                                                                                                                                                                                                                                                210 m² 685 000 €","link":"https://www.cosmosportugal.com/en-gb/property/spacious-4-bed-villa-with-private-garden-pool-backing-onto-rustic-land/22903070","retrieved":1747003485358},{"title":"Luxurious 4-Bedroom Villa in Vale da Telha 1 275 000 €","contents":" Luxurious 4-Bedroom Villa in Vale da Telha Experience the ultimate in elegance and comfort with this expansive 4-bedroom villa, nestled in the tranquil and picturesque Vale da Telha. This stunning property seamlessly combines modern amenities... Ref. M-0202 4                                                                                                                                                                                                                                                                                                                                                                        3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  Outdoor                                                                                                                                                                                                                                                                                                                                                                        224.5 m²                                                                                                                                                                                                                                                                                                                                                                        320 m² 1 275 000 €","link":"https://www.cosmosportugal.com/en-gb/property/luxurious-4-bedroom-villa-in-vale-da-telha/21484641","retrieved":1747003485358},{"title":"2+1 bedroom Country house with natural swimming pool in Aljezur 550 000 €","contents":" 2+1 bedroom Country house with natural swimming pool in Aljezur Perfectly located countryside house just 5 minutes drive from Aljezur town centre and 10 minutes from Amoreira beach. The local restaurant/bar is only 5 minutes walk from the property. \n\nThis fully... Ref. M-0115 3                                                                                                                                                                                                                                                                                                                                                                        3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                152 m² 550 000 €","link":"https://www.cosmosportugal.com/en-gb/property/2-1-bedroom-country-house-with-natural-swimming-pool-in-aljezur/19698754","retrieved":1747003485358},{"title":"Renovated 1 bed cottage in Aljezur historical centre 285 000 €","contents":" Renovated 1 bed cottage in Aljezur historical centre Quint cottage located in the hilltop of Aljezur old town moments away from the castle and high street. The property has been completely remodelled and has one bedroom and a large yard with views over... Ref. M-0163 1                                                                                                                                                                                                                                                                                                                                                                        1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                57 m² 285 000 €","link":"https://www.cosmosportugal.com/en-gb/property/renovated-1-bed-cottage-in-aljezur-historical-centre/20222354","retrieved":1747003485359},{"title":"Super spacious Villa in Vale da Telha 530 000 €","contents":" Super spacious Villa in Vale da Telha Located on a quiet road in Vale da Telha, this large villa offers a great opportunity for those looking to put their personal touch on a home. Overlooking natural scrubland and just a short walk from... Ref. M-0214 4                                                                                                                                                                                                                                                                                                                                                                        3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  Outdoor                                                                                                                                                                                                                                                                                                                                                                                                                                220 m² 530 000 €","link":"https://www.cosmosportugal.com/en-gb/property/super-spacious-villa-in-vale-da-telha/21535340","retrieved":1747003485360},{"title":"Serene Rustic Retreat in Aljezur 65 000 €","contents":" Serene Rustic Retreat in Aljezur Nestled in the serene countryside of Aljezur, this 1 hectare of rustic land offers an opportunity to own a peaceful retreat surrounded by nature. Accessed via a charming stream crossing, the land has... Ref. T-0221 4250 m² 65 000 €","link":"https://www.cosmosportugal.com/en-gb/property/serene-rustic-retreat-in-aljezur/21652027","retrieved":1747003485360},{"title":"Attractive 3 bed villa with pool in Vale da Telha 660 000 €","contents":" Attractive 3 bed villa with pool in Vale da Telha Nestled on a generous 1020m2 plot, this spacious three-bedroom villa offers a comfortable and inviting retreat for those who appreciate privacy and tranquility. The exterior of the villa reflects a t... Ref. M-0192 3                                                                                                                                                                                                                                                                                                                                                                        2                                                                                                                                                                                                                                                                                                                                                                         2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         201 m² 660 000 €","link":"https://www.cosmosportugal.com/en-gb/property/attractive-3-bed-villa-with-pool-in-vale-da-telha/20987745","retrieved":1747003485363},{"title":"Impressive villa with lake views Price upon request","contents":" Impressive villa with lake views Superb villa with lake and distant sea views, nestled in the quietest area of this very sought after urbanisation. This beautifully presented villa is very well maintained and comes fully equipped ma... Ref. M-0156 3                                                                                                                                                                                                                                                                                                                                                                        3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         194.35 m²                                                                                                                                                                                                                                                                                                                                                                        194.35 m² Price upon request","link":"https://www.cosmosportugal.com/en-gb/property/impressive-villa-with-lake-views/20205749","retrieved":1747003485365},{"title":"Charming T1+1 terrace house in the Heart of Rogil 266 000 €","contents":" Charming T1+1 terrace house in the Heart of Rogil Nestled in the vibrant seaside town of Rogil, this delightful 1-bedroom townhouse with a bonus attic room offers the perfect blend of comfort and convenience. Located only a few steps from local amen... Ref. M-0223 1                                                                                                                                                                                                                                                                                                                                                                        1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        110.75 m²                                                                                                                                                                                                                                                                                                                                                                        150 m² 266 000 €","link":"https://www.cosmosportugal.com/en-gb/property/charming-t1-1-terrace-house-in-the-heart-of-rogil/21684722","retrieved":1747003485369}]}